src/xml/request/10.user_defined_boost.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <ns1:searchRequest>
      <ns1:query>dkcclterm.ti="high fidelity"</ns1:query>
      <ns1:agency>100200</ns1:agency>
      <ns1:profile>test</ns1:profile>
      <ns1:collectionType>manifestation</ns1:collectionType>
      <ns1:start>1</ns1:start>
      <ns1:stepValue>10</ns1:stepValue>
      <ns1:userDefinedBoost>
         <ns1:fieldName>term.workType</ns1:fieldName>
         <ns1:fieldValue>literature</ns1:fieldValue>
         <ns1:weight>4</ns1:weight>
      </ns1:userDefinedBoost>
    </ns1:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
